qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/usb.h
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP11_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP11_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP11_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP11_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP11_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP11_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP12
// Description : Interrupt endpoint 12. Only valid for HOST mode.
#define USB_ADDR_ENDP12_OFFSET _u(0x00000030)
#define USB_ADDR_ENDP12_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP12_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP12_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP12_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP12_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP12_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP12_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP12_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP12_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP12_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP12_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP12_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP12_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP12_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP12_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP12_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP12_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP12_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP12_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP12_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP12_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP12_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP13
// Description : Interrupt endpoint 13. Only valid for HOST mode.
#define USB_ADDR_ENDP13_OFFSET _u(0x00000034)
#define USB_ADDR_ENDP13_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP13_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP13_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP13_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP13_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP13_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP13_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP13_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP13_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP13_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP13_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP13_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP13_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP13_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP13_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP13_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP13_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP13_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP13_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP13_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP13_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP13_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP14
// Description : Interrupt endpoint 14. Only valid for HOST mode.
#define USB_ADDR_ENDP14_OFFSET _u(0x00000038)
#define USB_ADDR_ENDP14_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP14_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP14_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP14_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP14_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP14_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP14_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP14_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP14_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP14_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP14_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP14_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP14_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP14_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP14_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP14_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP14_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP14_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP14_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP14_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP14_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP14_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_ADDR_ENDP15
// Description : Interrupt endpoint 15. Only valid for HOST mode.
#define USB_ADDR_ENDP15_OFFSET _u(0x0000003c)
#define USB_ADDR_ENDP15_BITS   _u(0x060f007f)
#define USB_ADDR_ENDP15_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP15_INTEP_PREAMBLE
// Description : Interrupt EP requires preamble (is a low speed device on a full
//               speed hub)
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_RESET  _u(0x0)
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_BITS   _u(0x04000000)
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_MSB    _u(26)
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_LSB    _u(26)
#define USB_ADDR_ENDP15_INTEP_PREAMBLE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP15_INTEP_DIR
// Description : Direction of the interrupt endpoint. In=0, Out=1
#define USB_ADDR_ENDP15_INTEP_DIR_RESET  _u(0x0)
#define USB_ADDR_ENDP15_INTEP_DIR_BITS   _u(0x02000000)
#define USB_ADDR_ENDP15_INTEP_DIR_MSB    _u(25)
#define USB_ADDR_ENDP15_INTEP_DIR_LSB    _u(25)
#define USB_ADDR_ENDP15_INTEP_DIR_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP15_ENDPOINT
// Description : Endpoint number of the interrupt endpoint
#define USB_ADDR_ENDP15_ENDPOINT_RESET  _u(0x0)
#define USB_ADDR_ENDP15_ENDPOINT_BITS   _u(0x000f0000)
#define USB_ADDR_ENDP15_ENDPOINT_MSB    _u(19)
#define USB_ADDR_ENDP15_ENDPOINT_LSB    _u(16)
#define USB_ADDR_ENDP15_ENDPOINT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_ADDR_ENDP15_ADDRESS
// Description : Device address
#define USB_ADDR_ENDP15_ADDRESS_RESET  _u(0x00)
#define USB_ADDR_ENDP15_ADDRESS_BITS   _u(0x0000007f)
#define USB_ADDR_ENDP15_ADDRESS_MSB    _u(6)
#define USB_ADDR_ENDP15_ADDRESS_LSB    _u(0)
#define USB_ADDR_ENDP15_ADDRESS_ACCESS "RW"
// =============================================================================
// Register    : USB_MAIN_CTRL
// Description : Main control register
#define USB_MAIN_CTRL_OFFSET _u(0x00000040)
#define USB_MAIN_CTRL_BITS   _u(0x80000003)
#define USB_MAIN_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_MAIN_CTRL_SIM_TIMING
// Description : Reduced timings for simulation
#define USB_MAIN_CTRL_SIM_TIMING_RESET  _u(0x0)
#define USB_MAIN_CTRL_SIM_TIMING_BITS   _u(0x80000000)
#define USB_MAIN_CTRL_SIM_TIMING_MSB    _u(31)
#define USB_MAIN_CTRL_SIM_TIMING_LSB    _u(31)
#define USB_MAIN_CTRL_SIM_TIMING_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_MAIN_CTRL_HOST_NDEVICE
// Description : Device mode = 0, Host mode = 1
#define USB_MAIN_CTRL_HOST_NDEVICE_RESET  _u(0x0)
#define USB_MAIN_CTRL_HOST_NDEVICE_BITS   _u(0x00000002)
#define USB_MAIN_CTRL_HOST_NDEVICE_MSB    _u(1)
#define USB_MAIN_CTRL_HOST_NDEVICE_LSB    _u(1)
#define USB_MAIN_CTRL_HOST_NDEVICE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_MAIN_CTRL_CONTROLLER_EN
// Description : Enable controller
#define USB_MAIN_CTRL_CONTROLLER_EN_RESET  _u(0x0)
#define USB_MAIN_CTRL_CONTROLLER_EN_BITS   _u(0x00000001)
#define USB_MAIN_CTRL_CONTROLLER_EN_MSB    _u(0)
#define USB_MAIN_CTRL_CONTROLLER_EN_LSB    _u(0)
#define USB_MAIN_CTRL_CONTROLLER_EN_ACCESS "RW"
// =============================================================================
// Register    : USB_SOF_WR
// Description : Set the SOF (Start of Frame) frame number in the host
//               controller. The SOF packet is sent every 1ms and the host will
//               increment the frame number by 1 each time.
#define USB_SOF_WR_OFFSET _u(0x00000044)
#define USB_SOF_WR_BITS   _u(0x000007ff)
#define USB_SOF_WR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_SOF_WR_COUNT
// Description : None
#define USB_SOF_WR_COUNT_RESET  _u(0x000)
#define USB_SOF_WR_COUNT_BITS   _u(0x000007ff)
#define USB_SOF_WR_COUNT_MSB    _u(10)
#define USB_SOF_WR_COUNT_LSB    _u(0)
#define USB_SOF_WR_COUNT_ACCESS "WF"
// =============================================================================
// Register    : USB_SOF_RD
// Description : Read the last SOF (Start of Frame) frame number seen. In device
//               mode the last SOF received from the host. In host mode the last
//               SOF sent by the host.
#define USB_SOF_RD_OFFSET _u(0x00000048)
#define USB_SOF_RD_BITS   _u(0x000007ff)
#define USB_SOF_RD_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_SOF_RD_COUNT
// Description : None
#define USB_SOF_RD_COUNT_RESET  _u(0x000)
#define USB_SOF_RD_COUNT_BITS   _u(0x000007ff)
#define USB_SOF_RD_COUNT_MSB    _u(10)
#define USB_SOF_RD_COUNT_LSB    _u(0)
#define USB_SOF_RD_COUNT_ACCESS "RO"
// =============================================================================
// Register    : USB_SIE_CTRL
// Description : SIE control register
#define USB_SIE_CTRL_OFFSET _u(0x0000004c)
#define USB_SIE_CTRL_BITS   _u(0xff07bf5f)
#define USB_SIE_CTRL_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_EP0_INT_STALL
// Description : Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a STALL
#define USB_SIE_CTRL_EP0_INT_STALL_RESET  _u(0x0)
#define USB_SIE_CTRL_EP0_INT_STALL_BITS   _u(0x80000000)
#define USB_SIE_CTRL_EP0_INT_STALL_MSB    _u(31)
#define USB_SIE_CTRL_EP0_INT_STALL_LSB    _u(31)
#define USB_SIE_CTRL_EP0_INT_STALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_EP0_DOUBLE_BUF
// Description : Device: EP0 single buffered = 0, double buffered = 1
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_RESET  _u(0x0)
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_BITS   _u(0x40000000)
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_MSB    _u(30)
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_LSB    _u(30)
#define USB_SIE_CTRL_EP0_DOUBLE_BUF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_EP0_INT_1BUF
// Description : Device: Set bit in BUFF_STATUS for every buffer completed on
//               EP0
#define USB_SIE_CTRL_EP0_INT_1BUF_RESET  _u(0x0)
#define USB_SIE_CTRL_EP0_INT_1BUF_BITS   _u(0x20000000)
#define USB_SIE_CTRL_EP0_INT_1BUF_MSB    _u(29)
#define USB_SIE_CTRL_EP0_INT_1BUF_LSB    _u(29)
#define USB_SIE_CTRL_EP0_INT_1BUF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_EP0_INT_2BUF
// Description : Device: Set bit in BUFF_STATUS for every 2 buffers completed on
//               EP0
#define USB_SIE_CTRL_EP0_INT_2BUF_RESET  _u(0x0)
#define USB_SIE_CTRL_EP0_INT_2BUF_BITS   _u(0x10000000)
#define USB_SIE_CTRL_EP0_INT_2BUF_MSB    _u(28)
#define USB_SIE_CTRL_EP0_INT_2BUF_LSB    _u(28)
#define USB_SIE_CTRL_EP0_INT_2BUF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_EP0_INT_NAK
// Description : Device: Set bit in EP_STATUS_STALL_NAK when EP0 sends a NAK
#define USB_SIE_CTRL_EP0_INT_NAK_RESET  _u(0x0)
#define USB_SIE_CTRL_EP0_INT_NAK_BITS   _u(0x08000000)
#define USB_SIE_CTRL_EP0_INT_NAK_MSB    _u(27)
#define USB_SIE_CTRL_EP0_INT_NAK_LSB    _u(27)
#define USB_SIE_CTRL_EP0_INT_NAK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_DIRECT_EN
// Description : Direct bus drive enable
#define USB_SIE_CTRL_DIRECT_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_DIRECT_EN_BITS   _u(0x04000000)
#define USB_SIE_CTRL_DIRECT_EN_MSB    _u(26)
#define USB_SIE_CTRL_DIRECT_EN_LSB    _u(26)
#define USB_SIE_CTRL_DIRECT_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_DIRECT_DP
// Description : Direct control of DP
#define USB_SIE_CTRL_DIRECT_DP_RESET  _u(0x0)
#define USB_SIE_CTRL_DIRECT_DP_BITS   _u(0x02000000)
#define USB_SIE_CTRL_DIRECT_DP_MSB    _u(25)
#define USB_SIE_CTRL_DIRECT_DP_LSB    _u(25)
#define USB_SIE_CTRL_DIRECT_DP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_DIRECT_DM
// Description : Direct control of DM
#define USB_SIE_CTRL_DIRECT_DM_RESET  _u(0x0)
#define USB_SIE_CTRL_DIRECT_DM_BITS   _u(0x01000000)
#define USB_SIE_CTRL_DIRECT_DM_MSB    _u(24)
#define USB_SIE_CTRL_DIRECT_DM_LSB    _u(24)
#define USB_SIE_CTRL_DIRECT_DM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_TRANSCEIVER_PD
// Description : Power down bus transceiver
#define USB_SIE_CTRL_TRANSCEIVER_PD_RESET  _u(0x0)
#define USB_SIE_CTRL_TRANSCEIVER_PD_BITS   _u(0x00040000)
#define USB_SIE_CTRL_TRANSCEIVER_PD_MSB    _u(18)
#define USB_SIE_CTRL_TRANSCEIVER_PD_LSB    _u(18)
#define USB_SIE_CTRL_TRANSCEIVER_PD_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_RPU_OPT
// Description : Device: Pull-up strength (0=1K2, 1=2k3)
#define USB_SIE_CTRL_RPU_OPT_RESET  _u(0x0)
#define USB_SIE_CTRL_RPU_OPT_BITS   _u(0x00020000)
#define USB_SIE_CTRL_RPU_OPT_MSB    _u(17)
#define USB_SIE_CTRL_RPU_OPT_LSB    _u(17)
#define USB_SIE_CTRL_RPU_OPT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_PULLUP_EN
// Description : Device: Enable pull up resistor
#define USB_SIE_CTRL_PULLUP_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_PULLUP_EN_BITS   _u(0x00010000)
#define USB_SIE_CTRL_PULLUP_EN_MSB    _u(16)
#define USB_SIE_CTRL_PULLUP_EN_LSB    _u(16)
#define USB_SIE_CTRL_PULLUP_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_PULLDOWN_EN
// Description : Host: Enable pull down resistors
#define USB_SIE_CTRL_PULLDOWN_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_PULLDOWN_EN_BITS   _u(0x00008000)
#define USB_SIE_CTRL_PULLDOWN_EN_MSB    _u(15)
#define USB_SIE_CTRL_PULLDOWN_EN_LSB    _u(15)
#define USB_SIE_CTRL_PULLDOWN_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_RESET_BUS
// Description : Host: Reset bus
#define USB_SIE_CTRL_RESET_BUS_RESET  _u(0x0)
#define USB_SIE_CTRL_RESET_BUS_BITS   _u(0x00002000)
#define USB_SIE_CTRL_RESET_BUS_MSB    _u(13)
#define USB_SIE_CTRL_RESET_BUS_LSB    _u(13)
#define USB_SIE_CTRL_RESET_BUS_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_RESUME
// Description : Device: Remote wakeup. Device can initiate its own resume after
//               suspend.
#define USB_SIE_CTRL_RESUME_RESET  _u(0x0)
#define USB_SIE_CTRL_RESUME_BITS   _u(0x00001000)
#define USB_SIE_CTRL_RESUME_MSB    _u(12)
#define USB_SIE_CTRL_RESUME_LSB    _u(12)
#define USB_SIE_CTRL_RESUME_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_VBUS_EN
// Description : Host: Enable VBUS
#define USB_SIE_CTRL_VBUS_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_VBUS_EN_BITS   _u(0x00000800)
#define USB_SIE_CTRL_VBUS_EN_MSB    _u(11)
#define USB_SIE_CTRL_VBUS_EN_LSB    _u(11)
#define USB_SIE_CTRL_VBUS_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_KEEP_ALIVE_EN
// Description : Host: Enable keep alive packet (for low speed bus)
#define USB_SIE_CTRL_KEEP_ALIVE_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_KEEP_ALIVE_EN_BITS   _u(0x00000400)
#define USB_SIE_CTRL_KEEP_ALIVE_EN_MSB    _u(10)
#define USB_SIE_CTRL_KEEP_ALIVE_EN_LSB    _u(10)
#define USB_SIE_CTRL_KEEP_ALIVE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_SOF_EN
// Description : Host: Enable SOF generation (for full speed bus)
#define USB_SIE_CTRL_SOF_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_SOF_EN_BITS   _u(0x00000200)
#define USB_SIE_CTRL_SOF_EN_MSB    _u(9)
#define USB_SIE_CTRL_SOF_EN_LSB    _u(9)
#define USB_SIE_CTRL_SOF_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_SOF_SYNC
// Description : Host: Delay packet(s) until after SOF
#define USB_SIE_CTRL_SOF_SYNC_RESET  _u(0x0)
#define USB_SIE_CTRL_SOF_SYNC_BITS   _u(0x00000100)
#define USB_SIE_CTRL_SOF_SYNC_MSB    _u(8)
#define USB_SIE_CTRL_SOF_SYNC_LSB    _u(8)
#define USB_SIE_CTRL_SOF_SYNC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_PREAMBLE_EN
// Description : Host: Preable enable for LS device on FS hub
#define USB_SIE_CTRL_PREAMBLE_EN_RESET  _u(0x0)
#define USB_SIE_CTRL_PREAMBLE_EN_BITS   _u(0x00000040)
#define USB_SIE_CTRL_PREAMBLE_EN_MSB    _u(6)
#define USB_SIE_CTRL_PREAMBLE_EN_LSB    _u(6)
#define USB_SIE_CTRL_PREAMBLE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_STOP_TRANS
// Description : Host: Stop transaction
#define USB_SIE_CTRL_STOP_TRANS_RESET  _u(0x0)
#define USB_SIE_CTRL_STOP_TRANS_BITS   _u(0x00000010)
#define USB_SIE_CTRL_STOP_TRANS_MSB    _u(4)
#define USB_SIE_CTRL_STOP_TRANS_LSB    _u(4)
#define USB_SIE_CTRL_STOP_TRANS_ACCESS "SC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_RECEIVE_DATA
// Description : Host: Receive transaction (IN to host)
#define USB_SIE_CTRL_RECEIVE_DATA_RESET  _u(0x0)
#define USB_SIE_CTRL_RECEIVE_DATA_BITS   _u(0x00000008)
#define USB_SIE_CTRL_RECEIVE_DATA_MSB    _u(3)
#define USB_SIE_CTRL_RECEIVE_DATA_LSB    _u(3)
#define USB_SIE_CTRL_RECEIVE_DATA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_SEND_DATA
// Description : Host: Send transaction (OUT from host)
#define USB_SIE_CTRL_SEND_DATA_RESET  _u(0x0)
#define USB_SIE_CTRL_SEND_DATA_BITS   _u(0x00000004)
#define USB_SIE_CTRL_SEND_DATA_MSB    _u(2)
#define USB_SIE_CTRL_SEND_DATA_LSB    _u(2)
#define USB_SIE_CTRL_SEND_DATA_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_SEND_SETUP
// Description : Host: Send Setup packet
#define USB_SIE_CTRL_SEND_SETUP_RESET  _u(0x0)
#define USB_SIE_CTRL_SEND_SETUP_BITS   _u(0x00000002)
#define USB_SIE_CTRL_SEND_SETUP_MSB    _u(1)
#define USB_SIE_CTRL_SEND_SETUP_LSB    _u(1)
#define USB_SIE_CTRL_SEND_SETUP_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_CTRL_START_TRANS
// Description : Host: Start transaction
#define USB_SIE_CTRL_START_TRANS_RESET  _u(0x0)
#define USB_SIE_CTRL_START_TRANS_BITS   _u(0x00000001)
#define USB_SIE_CTRL_START_TRANS_MSB    _u(0)
#define USB_SIE_CTRL_START_TRANS_LSB    _u(0)
#define USB_SIE_CTRL_START_TRANS_ACCESS "SC"
// =============================================================================
// Register    : USB_SIE_STATUS
// Description : SIE status register
#define USB_SIE_STATUS_OFFSET _u(0x00000050)
#define USB_SIE_STATUS_BITS   _u(0xff0f0f1d)
#define USB_SIE_STATUS_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_DATA_SEQ_ERROR
// Description : Data Sequence Error.
//
//               The device can raise a sequence error in the following
//               conditions:
//
//               * A SETUP packet is received followed by a DATA1 packet (data
//               phase should always be DATA0) * An OUT packet is received from
//               the host but doesn't match the data pid in the buffer control
//               register read from DPSRAM
//
//               The host can raise a data sequence error in the following
//               conditions:
//
//               * An IN packet from the device has the wrong data PID
#define USB_SIE_STATUS_DATA_SEQ_ERROR_RESET  _u(0x0)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_BITS   _u(0x80000000)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_MSB    _u(31)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_LSB    _u(31)
#define USB_SIE_STATUS_DATA_SEQ_ERROR_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_ACK_REC
// Description : ACK received. Raised by both host and device.
#define USB_SIE_STATUS_ACK_REC_RESET  _u(0x0)
#define USB_SIE_STATUS_ACK_REC_BITS   _u(0x40000000)
#define USB_SIE_STATUS_ACK_REC_MSB    _u(30)
#define USB_SIE_STATUS_ACK_REC_LSB    _u(30)
#define USB_SIE_STATUS_ACK_REC_ACCESS "WC"
// -----------------------------------------------------------------------------
// Field       : USB_SIE_STATUS_STALL_REC
// Description : Host: STALL received
