qmk/qmk_firmware/lib/pico-sdk/src/rp2040/hardware_regs/include/hardware/regs/usb.h
// Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_BITS   _u(0x00000100)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_MSB    _u(8)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_LSB    _u(8)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_BITS   _u(0x00000080)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_MSB    _u(7)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_LSB    _u(7)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_BITS   _u(0x00000040)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_MSB    _u(6)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_LSB    _u(6)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DM_OE_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_BITS   _u(0x00000020)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_MSB    _u(5)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_LSB    _u(5)
#define USB_USBPHY_DIRECT_OVERRIDE_TX_DP_OE_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_BITS   _u(0x00000010)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_MSB    _u(4)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_LSB    _u(4)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLDN_EN_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_BITS   _u(0x00000008)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_MSB    _u(3)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_LSB    _u(3)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLDN_EN_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_BITS   _u(0x00000004)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_MSB    _u(2)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_LSB    _u(2)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_EN_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_BITS   _u(0x00000002)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_MSB    _u(1)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_LSB    _u(1)
#define USB_USBPHY_DIRECT_OVERRIDE_DM_PULLUP_HISEL_OVERRIDE_EN_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN
// Description : None
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_RESET  _u(0x0)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_BITS   _u(0x00000001)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_MSB    _u(0)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_LSB    _u(0)
#define USB_USBPHY_DIRECT_OVERRIDE_DP_PULLUP_HISEL_OVERRIDE_EN_ACCESS "RW"
// =============================================================================
// Register    : USB_USBPHY_TRIM
// Description : Used to adjust trim values of USB phy pull down resistors.
#define USB_USBPHY_TRIM_OFFSET _u(0x00000084)
#define USB_USBPHY_TRIM_BITS   _u(0x00001f1f)
#define USB_USBPHY_TRIM_RESET  _u(0x00001f1f)
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_TRIM_DM_PULLDN_TRIM
// Description : Value to drive to USB PHY
//               DM pulldown resistor trim control
//               Experimental data suggests that the reset value will work, but
//               this register allows adjustment if required
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_RESET  _u(0x1f)
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_BITS   _u(0x00001f00)
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_MSB    _u(12)
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_LSB    _u(8)
#define USB_USBPHY_TRIM_DM_PULLDN_TRIM_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_USBPHY_TRIM_DP_PULLDN_TRIM
// Description : Value to drive to USB PHY
//               DP pulldown resistor trim control
//               Experimental data suggests that the reset value will work, but
//               this register allows adjustment if required
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_RESET  _u(0x1f)
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_BITS   _u(0x0000001f)
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_MSB    _u(4)
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_LSB    _u(0)
#define USB_USBPHY_TRIM_DP_PULLDN_TRIM_ACCESS "RW"
// =============================================================================
// Register    : USB_INTR
// Description : Raw Interrupts
#define USB_INTR_OFFSET _u(0x0000008c)
#define USB_INTR_BITS   _u(0x000fffff)
#define USB_INTR_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_INTR_EP_STALL_NAK
// Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
//               clearing all bits in EP_STATUS_STALL_NAK.
#define USB_INTR_EP_STALL_NAK_RESET  _u(0x0)
#define USB_INTR_EP_STALL_NAK_BITS   _u(0x00080000)
#define USB_INTR_EP_STALL_NAK_MSB    _u(19)
#define USB_INTR_EP_STALL_NAK_LSB    _u(19)
#define USB_INTR_EP_STALL_NAK_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ABORT_DONE
// Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
//               bits in ABORT_DONE.
#define USB_INTR_ABORT_DONE_RESET  _u(0x0)
#define USB_INTR_ABORT_DONE_BITS   _u(0x00040000)
#define USB_INTR_ABORT_DONE_MSB    _u(18)
#define USB_INTR_ABORT_DONE_LSB    _u(18)
#define USB_INTR_ABORT_DONE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_DEV_SOF
// Description : Set every time the device receives a SOF (Start of Frame)
//               packet. Cleared by reading SOF_RD
#define USB_INTR_DEV_SOF_RESET  _u(0x0)
#define USB_INTR_DEV_SOF_BITS   _u(0x00020000)
#define USB_INTR_DEV_SOF_MSB    _u(17)
#define USB_INTR_DEV_SOF_LSB    _u(17)
#define USB_INTR_DEV_SOF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_SETUP_REQ
// Description : Device. Source: SIE_STATUS.SETUP_REC
#define USB_INTR_SETUP_REQ_RESET  _u(0x0)
#define USB_INTR_SETUP_REQ_BITS   _u(0x00010000)
#define USB_INTR_SETUP_REQ_MSB    _u(16)
#define USB_INTR_SETUP_REQ_LSB    _u(16)
#define USB_INTR_SETUP_REQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_DEV_RESUME_FROM_HOST
// Description : Set when the device receives a resume from the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTR_DEV_RESUME_FROM_HOST_RESET  _u(0x0)
#define USB_INTR_DEV_RESUME_FROM_HOST_BITS   _u(0x00008000)
#define USB_INTR_DEV_RESUME_FROM_HOST_MSB    _u(15)
#define USB_INTR_DEV_RESUME_FROM_HOST_LSB    _u(15)
#define USB_INTR_DEV_RESUME_FROM_HOST_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_DEV_SUSPEND
// Description : Set when the device suspend state changes. Cleared by writing
//               to SIE_STATUS.SUSPENDED
#define USB_INTR_DEV_SUSPEND_RESET  _u(0x0)
#define USB_INTR_DEV_SUSPEND_BITS   _u(0x00004000)
#define USB_INTR_DEV_SUSPEND_MSB    _u(14)
#define USB_INTR_DEV_SUSPEND_LSB    _u(14)
#define USB_INTR_DEV_SUSPEND_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_DEV_CONN_DIS
// Description : Set when the device connection state changes. Cleared by
//               writing to SIE_STATUS.CONNECTED
#define USB_INTR_DEV_CONN_DIS_RESET  _u(0x0)
#define USB_INTR_DEV_CONN_DIS_BITS   _u(0x00002000)
#define USB_INTR_DEV_CONN_DIS_MSB    _u(13)
#define USB_INTR_DEV_CONN_DIS_LSB    _u(13)
#define USB_INTR_DEV_CONN_DIS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_BUS_RESET
// Description : Source: SIE_STATUS.BUS_RESET
#define USB_INTR_BUS_RESET_RESET  _u(0x0)
#define USB_INTR_BUS_RESET_BITS   _u(0x00001000)
#define USB_INTR_BUS_RESET_MSB    _u(12)
#define USB_INTR_BUS_RESET_LSB    _u(12)
#define USB_INTR_BUS_RESET_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_VBUS_DETECT
// Description : Source: SIE_STATUS.VBUS_DETECTED
#define USB_INTR_VBUS_DETECT_RESET  _u(0x0)
#define USB_INTR_VBUS_DETECT_BITS   _u(0x00000800)
#define USB_INTR_VBUS_DETECT_MSB    _u(11)
#define USB_INTR_VBUS_DETECT_LSB    _u(11)
#define USB_INTR_VBUS_DETECT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_STALL
// Description : Source: SIE_STATUS.STALL_REC
#define USB_INTR_STALL_RESET  _u(0x0)
#define USB_INTR_STALL_BITS   _u(0x00000400)
#define USB_INTR_STALL_MSB    _u(10)
#define USB_INTR_STALL_LSB    _u(10)
#define USB_INTR_STALL_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ERROR_CRC
// Description : Source: SIE_STATUS.CRC_ERROR
#define USB_INTR_ERROR_CRC_RESET  _u(0x0)
#define USB_INTR_ERROR_CRC_BITS   _u(0x00000200)
#define USB_INTR_ERROR_CRC_MSB    _u(9)
#define USB_INTR_ERROR_CRC_LSB    _u(9)
#define USB_INTR_ERROR_CRC_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ERROR_BIT_STUFF
// Description : Source: SIE_STATUS.BIT_STUFF_ERROR
#define USB_INTR_ERROR_BIT_STUFF_RESET  _u(0x0)
#define USB_INTR_ERROR_BIT_STUFF_BITS   _u(0x00000100)
#define USB_INTR_ERROR_BIT_STUFF_MSB    _u(8)
#define USB_INTR_ERROR_BIT_STUFF_LSB    _u(8)
#define USB_INTR_ERROR_BIT_STUFF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ERROR_RX_OVERFLOW
// Description : Source: SIE_STATUS.RX_OVERFLOW
#define USB_INTR_ERROR_RX_OVERFLOW_RESET  _u(0x0)
#define USB_INTR_ERROR_RX_OVERFLOW_BITS   _u(0x00000080)
#define USB_INTR_ERROR_RX_OVERFLOW_MSB    _u(7)
#define USB_INTR_ERROR_RX_OVERFLOW_LSB    _u(7)
#define USB_INTR_ERROR_RX_OVERFLOW_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ERROR_RX_TIMEOUT
// Description : Source: SIE_STATUS.RX_TIMEOUT
#define USB_INTR_ERROR_RX_TIMEOUT_RESET  _u(0x0)
#define USB_INTR_ERROR_RX_TIMEOUT_BITS   _u(0x00000040)
#define USB_INTR_ERROR_RX_TIMEOUT_MSB    _u(6)
#define USB_INTR_ERROR_RX_TIMEOUT_LSB    _u(6)
#define USB_INTR_ERROR_RX_TIMEOUT_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_ERROR_DATA_SEQ
// Description : Source: SIE_STATUS.DATA_SEQ_ERROR
#define USB_INTR_ERROR_DATA_SEQ_RESET  _u(0x0)
#define USB_INTR_ERROR_DATA_SEQ_BITS   _u(0x00000020)
#define USB_INTR_ERROR_DATA_SEQ_MSB    _u(5)
#define USB_INTR_ERROR_DATA_SEQ_LSB    _u(5)
#define USB_INTR_ERROR_DATA_SEQ_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_BUFF_STATUS
// Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
//               all bits in BUFF_STATUS.
#define USB_INTR_BUFF_STATUS_RESET  _u(0x0)
#define USB_INTR_BUFF_STATUS_BITS   _u(0x00000010)
#define USB_INTR_BUFF_STATUS_MSB    _u(4)
#define USB_INTR_BUFF_STATUS_LSB    _u(4)
#define USB_INTR_BUFF_STATUS_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_TRANS_COMPLETE
// Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
//               writing to this bit.
#define USB_INTR_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_INTR_TRANS_COMPLETE_BITS   _u(0x00000008)
#define USB_INTR_TRANS_COMPLETE_MSB    _u(3)
#define USB_INTR_TRANS_COMPLETE_LSB    _u(3)
#define USB_INTR_TRANS_COMPLETE_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_HOST_SOF
// Description : Host: raised every time the host sends a SOF (Start of Frame).
//               Cleared by reading SOF_RD
#define USB_INTR_HOST_SOF_RESET  _u(0x0)
#define USB_INTR_HOST_SOF_BITS   _u(0x00000004)
#define USB_INTR_HOST_SOF_MSB    _u(2)
#define USB_INTR_HOST_SOF_LSB    _u(2)
#define USB_INTR_HOST_SOF_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_HOST_RESUME
// Description : Host: raised when a device wakes up the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTR_HOST_RESUME_RESET  _u(0x0)
#define USB_INTR_HOST_RESUME_BITS   _u(0x00000002)
#define USB_INTR_HOST_RESUME_MSB    _u(1)
#define USB_INTR_HOST_RESUME_LSB    _u(1)
#define USB_INTR_HOST_RESUME_ACCESS "RO"
// -----------------------------------------------------------------------------
// Field       : USB_INTR_HOST_CONN_DIS
// Description : Host: raised when a device is connected or disconnected (i.e.
//               when SIE_STATUS.SPEED changes). Cleared by writing to
//               SIE_STATUS.SPEED
#define USB_INTR_HOST_CONN_DIS_RESET  _u(0x0)
#define USB_INTR_HOST_CONN_DIS_BITS   _u(0x00000001)
#define USB_INTR_HOST_CONN_DIS_MSB    _u(0)
#define USB_INTR_HOST_CONN_DIS_LSB    _u(0)
#define USB_INTR_HOST_CONN_DIS_ACCESS "RO"
// =============================================================================
// Register    : USB_INTE
// Description : Interrupt Enable
#define USB_INTE_OFFSET _u(0x00000090)
#define USB_INTE_BITS   _u(0x000fffff)
#define USB_INTE_RESET  _u(0x00000000)
// -----------------------------------------------------------------------------
// Field       : USB_INTE_EP_STALL_NAK
// Description : Raised when any bit in EP_STATUS_STALL_NAK is set. Clear by
//               clearing all bits in EP_STATUS_STALL_NAK.
#define USB_INTE_EP_STALL_NAK_RESET  _u(0x0)
#define USB_INTE_EP_STALL_NAK_BITS   _u(0x00080000)
#define USB_INTE_EP_STALL_NAK_MSB    _u(19)
#define USB_INTE_EP_STALL_NAK_LSB    _u(19)
#define USB_INTE_EP_STALL_NAK_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ABORT_DONE
// Description : Raised when any bit in ABORT_DONE is set. Clear by clearing all
//               bits in ABORT_DONE.
#define USB_INTE_ABORT_DONE_RESET  _u(0x0)
#define USB_INTE_ABORT_DONE_BITS   _u(0x00040000)
#define USB_INTE_ABORT_DONE_MSB    _u(18)
#define USB_INTE_ABORT_DONE_LSB    _u(18)
#define USB_INTE_ABORT_DONE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_SOF
// Description : Set every time the device receives a SOF (Start of Frame)
//               packet. Cleared by reading SOF_RD
#define USB_INTE_DEV_SOF_RESET  _u(0x0)
#define USB_INTE_DEV_SOF_BITS   _u(0x00020000)
#define USB_INTE_DEV_SOF_MSB    _u(17)
#define USB_INTE_DEV_SOF_LSB    _u(17)
#define USB_INTE_DEV_SOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_SETUP_REQ
// Description : Device. Source: SIE_STATUS.SETUP_REC
#define USB_INTE_SETUP_REQ_RESET  _u(0x0)
#define USB_INTE_SETUP_REQ_BITS   _u(0x00010000)
#define USB_INTE_SETUP_REQ_MSB    _u(16)
#define USB_INTE_SETUP_REQ_LSB    _u(16)
#define USB_INTE_SETUP_REQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_RESUME_FROM_HOST
// Description : Set when the device receives a resume from the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTE_DEV_RESUME_FROM_HOST_RESET  _u(0x0)
#define USB_INTE_DEV_RESUME_FROM_HOST_BITS   _u(0x00008000)
#define USB_INTE_DEV_RESUME_FROM_HOST_MSB    _u(15)
#define USB_INTE_DEV_RESUME_FROM_HOST_LSB    _u(15)
#define USB_INTE_DEV_RESUME_FROM_HOST_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_SUSPEND
// Description : Set when the device suspend state changes. Cleared by writing
//               to SIE_STATUS.SUSPENDED
#define USB_INTE_DEV_SUSPEND_RESET  _u(0x0)
#define USB_INTE_DEV_SUSPEND_BITS   _u(0x00004000)
#define USB_INTE_DEV_SUSPEND_MSB    _u(14)
#define USB_INTE_DEV_SUSPEND_LSB    _u(14)
#define USB_INTE_DEV_SUSPEND_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_DEV_CONN_DIS
// Description : Set when the device connection state changes. Cleared by
//               writing to SIE_STATUS.CONNECTED
#define USB_INTE_DEV_CONN_DIS_RESET  _u(0x0)
#define USB_INTE_DEV_CONN_DIS_BITS   _u(0x00002000)
#define USB_INTE_DEV_CONN_DIS_MSB    _u(13)
#define USB_INTE_DEV_CONN_DIS_LSB    _u(13)
#define USB_INTE_DEV_CONN_DIS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_BUS_RESET
// Description : Source: SIE_STATUS.BUS_RESET
#define USB_INTE_BUS_RESET_RESET  _u(0x0)
#define USB_INTE_BUS_RESET_BITS   _u(0x00001000)
#define USB_INTE_BUS_RESET_MSB    _u(12)
#define USB_INTE_BUS_RESET_LSB    _u(12)
#define USB_INTE_BUS_RESET_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_VBUS_DETECT
// Description : Source: SIE_STATUS.VBUS_DETECTED
#define USB_INTE_VBUS_DETECT_RESET  _u(0x0)
#define USB_INTE_VBUS_DETECT_BITS   _u(0x00000800)
#define USB_INTE_VBUS_DETECT_MSB    _u(11)
#define USB_INTE_VBUS_DETECT_LSB    _u(11)
#define USB_INTE_VBUS_DETECT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_STALL
// Description : Source: SIE_STATUS.STALL_REC
#define USB_INTE_STALL_RESET  _u(0x0)
#define USB_INTE_STALL_BITS   _u(0x00000400)
#define USB_INTE_STALL_MSB    _u(10)
#define USB_INTE_STALL_LSB    _u(10)
#define USB_INTE_STALL_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_CRC
// Description : Source: SIE_STATUS.CRC_ERROR
#define USB_INTE_ERROR_CRC_RESET  _u(0x0)
#define USB_INTE_ERROR_CRC_BITS   _u(0x00000200)
#define USB_INTE_ERROR_CRC_MSB    _u(9)
#define USB_INTE_ERROR_CRC_LSB    _u(9)
#define USB_INTE_ERROR_CRC_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_BIT_STUFF
// Description : Source: SIE_STATUS.BIT_STUFF_ERROR
#define USB_INTE_ERROR_BIT_STUFF_RESET  _u(0x0)
#define USB_INTE_ERROR_BIT_STUFF_BITS   _u(0x00000100)
#define USB_INTE_ERROR_BIT_STUFF_MSB    _u(8)
#define USB_INTE_ERROR_BIT_STUFF_LSB    _u(8)
#define USB_INTE_ERROR_BIT_STUFF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_RX_OVERFLOW
// Description : Source: SIE_STATUS.RX_OVERFLOW
#define USB_INTE_ERROR_RX_OVERFLOW_RESET  _u(0x0)
#define USB_INTE_ERROR_RX_OVERFLOW_BITS   _u(0x00000080)
#define USB_INTE_ERROR_RX_OVERFLOW_MSB    _u(7)
#define USB_INTE_ERROR_RX_OVERFLOW_LSB    _u(7)
#define USB_INTE_ERROR_RX_OVERFLOW_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_RX_TIMEOUT
// Description : Source: SIE_STATUS.RX_TIMEOUT
#define USB_INTE_ERROR_RX_TIMEOUT_RESET  _u(0x0)
#define USB_INTE_ERROR_RX_TIMEOUT_BITS   _u(0x00000040)
#define USB_INTE_ERROR_RX_TIMEOUT_MSB    _u(6)
#define USB_INTE_ERROR_RX_TIMEOUT_LSB    _u(6)
#define USB_INTE_ERROR_RX_TIMEOUT_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_ERROR_DATA_SEQ
// Description : Source: SIE_STATUS.DATA_SEQ_ERROR
#define USB_INTE_ERROR_DATA_SEQ_RESET  _u(0x0)
#define USB_INTE_ERROR_DATA_SEQ_BITS   _u(0x00000020)
#define USB_INTE_ERROR_DATA_SEQ_MSB    _u(5)
#define USB_INTE_ERROR_DATA_SEQ_LSB    _u(5)
#define USB_INTE_ERROR_DATA_SEQ_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_BUFF_STATUS
// Description : Raised when any bit in BUFF_STATUS is set. Clear by clearing
//               all bits in BUFF_STATUS.
#define USB_INTE_BUFF_STATUS_RESET  _u(0x0)
#define USB_INTE_BUFF_STATUS_BITS   _u(0x00000010)
#define USB_INTE_BUFF_STATUS_MSB    _u(4)
#define USB_INTE_BUFF_STATUS_LSB    _u(4)
#define USB_INTE_BUFF_STATUS_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_TRANS_COMPLETE
// Description : Raised every time SIE_STATUS.TRANS_COMPLETE is set. Clear by
//               writing to this bit.
#define USB_INTE_TRANS_COMPLETE_RESET  _u(0x0)
#define USB_INTE_TRANS_COMPLETE_BITS   _u(0x00000008)
#define USB_INTE_TRANS_COMPLETE_MSB    _u(3)
#define USB_INTE_TRANS_COMPLETE_LSB    _u(3)
#define USB_INTE_TRANS_COMPLETE_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_HOST_SOF
// Description : Host: raised every time the host sends a SOF (Start of Frame).
//               Cleared by reading SOF_RD
#define USB_INTE_HOST_SOF_RESET  _u(0x0)
#define USB_INTE_HOST_SOF_BITS   _u(0x00000004)
#define USB_INTE_HOST_SOF_MSB    _u(2)
#define USB_INTE_HOST_SOF_LSB    _u(2)
#define USB_INTE_HOST_SOF_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_HOST_RESUME
// Description : Host: raised when a device wakes up the host. Cleared by
//               writing to SIE_STATUS.RESUME
#define USB_INTE_HOST_RESUME_RESET  _u(0x0)
#define USB_INTE_HOST_RESUME_BITS   _u(0x00000002)
#define USB_INTE_HOST_RESUME_MSB    _u(1)
#define USB_INTE_HOST_RESUME_LSB    _u(1)
#define USB_INTE_HOST_RESUME_ACCESS "RW"
// -----------------------------------------------------------------------------
// Field       : USB_INTE_HOST_CONN_DIS
// Description : Host: raised when a device is connected or disconnected (i.e.
